package app.service;

import java.util.Arrays;
import java.util.List;
import java.util.concurrent.ThreadLocalRandom;

/**
 * Позволяет получить имя случайным образом
 */
public class NameGenerator {
    /**
     * Возвращает случайное имя согласно полу
     */
    public static String getName(boolean gender) {
        if (gender) {
            return FEMALE_NAMES.get(ThreadLocalRandom.current().nextInt(FEMALE_NAMES.size()));
        } else {
            return MALE_NAMES.get(ThreadLocalRandom.current().nextInt(MALE_NAMES.size()));
        }
    }

    /**
     * Возвращает любое случайное имя
     */
    public static String getName() {
        return getName(ThreadLocalRandom.current().nextBoolean());
    }

    private static final List<String> FEMALE_NAMES = Arrays.asList(
            "Александра", "Алина", "Алиса", "Алла", "Анастасия",
            "Анжела", "Анна", "Антонина", "Арина", "Валентина",
            "Валерия", "Варвара", "Василиса", "Вера", "Вероника",
            "Виктория", "Виолетта", "Галина", "Дарья", "Диана",
            "Динара", "Екатерина", "Елена", "Елизавета", "Жанна",
            "Зинаида", "Зоя", "Ирина", "Карина", "Кристина",
            "Ксения", "Лариса", "Лидия", "Лилия", "Людмила",
            "Маргарита", "Марина", "Мария", "Надежда", "Наталья",
            "Нина", "Оксана", "Ольга", "Полина", "Светлана",
            "София", "Тамара", "Татьяна", "Ульяна", "Юлия",
            "Яна", "Аделина", "Аида", "Аксинья", "Алевтина",
            "Алёна", "Альбина", "Амалия", "Анастасия", "Ангелина",
            "Аниса", "Анфиса", "Белла", "Богдана", "Василина",
            "Венера", "Вилена", "Виолетта", "Владислава", "Гали",
            "Гелена", "Генриетта", "Глафира", "Гульнара", "Дина",
            "Доминика", "Евгения", "Евдокия", "Евлалия", "Евпраксия",
            "Злата", "Зульфия", "Изабелла", "Илона", "Инга",
            "Инесса", "Иннеса", "Иоланта", "Ия", "Калерия",
            "Камила", "Капитолина", "Каролина", "Кира", "Клавдия",
            "Клара", "Клеопатра", "Конкордия", "Корнелия", "Ксантиппа",
            "Лада", "Лаура", "Леокадия", "Леонора", "Лиана",
            "Лика", "Лина", "Лолита", "Лора", "Луиза",
            "Любовь", "Любомира", "Люция", "Майя", "Мальвина",
            "Марианна", "Марта", "Марфа", "Матрёна", "Матрона",
            "Милана", "Милена", "Мирослава", "Муза", "Наина",
            "Настасья", "Нелли", "Нонна", "Нора", "Октябрина",
            "Олеся", "Пелагея", "Прасковья", "Регина", "Рената",
            "Роза", "Розалия", "Розалинда", "Руслана", "Сабина",
            "Сарра", "Серафима", "Снежана", "Стелла", "Таисия"
    );

    private static final List<String> MALE_NAMES = Arrays.asList(
            "Александр", "Алексей", "Анатолий", "Андрей", "Антон",
            "Аркадий", "Артём", "Артур", "Борис", "Вадим",
            "Валентин", "Валерий", "Василий", "Виктор", "Виталий",
            "Владимир", "Владислав", "Вячеслав", "Геннадий", "Георгий",
            "Григорий", "Даниил", "Денис", "Дмитрий", "Евгений",
            "Иван", "Игорь", "Илья", "Кирилл", "Константин",
            "Лев", "Леонид", "Максим", "Михаил", "Никита",
            "Николай", "Олег", "Павел", "Пётр", "Роман",
            "Руслан", "Сергей", "Степан", "Тимур", "Фёдор",
            "Филипп", "Юрий", "Яков", "Алан", "Альберт",
            "Альфред", "Анатолий", "Аркадий", "Арсений", "Богдан",
            "Борислав", "Вениамин", "Владлен", "Всеволод", "Вячеслав",
            "Гавриил", "Гордей", "Данила", "Демьян", "Добрыня",
            "Дорофей", "Егор", "Ефим", "Захар", "Зиновий",
            "Илларион", "Иннокентий", "Иосиф", "Ипполит", "Кузьма",
            "Лаврентий", "Лазарь", "Леонтий", "Лукьян", "Макар",
            "Марк", "Матвей", "Мирослав", "Митрофан", "Модест",
            "Назар", "Нестор", "Никифор", "Никодим", "Никон",
            "Нил", "Онуфрий", "Осип", "Остап", "Пантелей",
            "Парфён", "Платон", "Прокофий", "Прохор", "Родион",
            "Ростислав", "Савва", "Савелий", "Самсон", "Семён",
            "Сильвестр", "Сократ", "Тарас", "Тихон", "Трофим",
            "Тимофей", "Ульян", "Устин", "Феликс", "Фёдор",
            "Фома", "Харитон", "Христофор", "Прохор", "Евдоким",
            "Вастилий", "Гурий", "Доминик", "Ермолай", "Константин",
            "Лонгин", "Мефодий", "Никанор", "Онисим", "Памфил",
            "Пахом", "Рафаил", "Рубен", "Саватий", "Севастьян",
            "Сидор", "Симон", "Спиридон", "Терентий", "Феофан",
            "Феодосий", "Филарет", "Флор", "Фрол", "Херсонес",
            "Эдуард", "Элий", "Эмиль", "Эраст", "Юстин"
    );
}
